Bwooce/tinygs_nRF52/src/main.cpp
        uint32_t payload_len = MIN(pub->message.payload.len, sizeof(rx_payload) - 1);
        int ret = mqtt_read_publish_payload(client, rx_payload, payload_len);
        if (ret < 0) {
            LOG_ERR("MQTT payload read error: %d", ret);
            break;
        }
        rx_payload[ret] = '\0';

        LOG_INF("MQTT RX [%s] (%d bytes)", rx_topic, ret);
        /* Truncate long payloads for logging — full payload is still parsed */
        if (ret > 0) {
            char saved = 0;
            if (ret > 200) { saved = rx_payload[200]; rx_payload[200] = '\0'; }
            LOG_INF("  payload: %s%s", (char *)rx_payload, ret > 200 ? "..." : "");
            if (saved) { rx_payload[200] = saved; }
        }

        /* Extract command name from topic:
         * tinygs/global/cmnd/XXX or tinygs/user/station/cmnd/XXX */
        const char *cmnd = strstr(rx_topic, "/cmnd/");
        if (cmnd) {
            cmnd += 6;  /* skip "/cmnd/" */
            LOG_INF("  command: %s", cmnd);

            if (strcmp(cmnd, "begine") == 0 ||
                strcmp(cmnd, "batch_conf") == 0) {
                if (radio != nullptr) {
                    /* Store raw payload as modem_conf before parsing
                     * (json_obj_parse modifies the buffer in-place) */
                    size_t conf_len = strlen((char *)rx_payload);
                    if (conf_len < sizeof(tinygs_radio.modem_conf)) {
                        memcpy(tinygs_radio.modem_conf, rx_payload, conf_len + 1);
                    } else {
                        LOG_WRN("modem_conf too large (%zu > %zu), skipped",
                                conf_len, sizeof(tinygs_radio.modem_conf) - 1);
                    }

                    /* Parse begine JSON via Zephyr json.h descriptors */
                    struct tinygs_begine_msg msg;
                    int64_t parsed = tinygs_parse_begine((char *)rx_payload, ret, &msg);
                    if (parsed < 0) {
                        LOG_ERR("begine parse failed");
                    } else {
                        /* Apply radio config via individual setters.
                         * TCXO 1.8V is configured once at init (persists).
                         * CRC and header set last — implicitHeader() writes
                         * all packet params to the SX1262 in one shot. */
                        float freq = tinygs_begine_get_freq(&msg);
                        if (freq > 100.0f && freq < 1000.0f) {
                            tinygs_radio.frequency = freq;
                            radio->setFrequency(freq + tinygs_radio.freq_offset / 1e6f);
                        }
                        float bw = tinygs_begine_get_bw(&msg);
                        if (bw > 0.0f) {
                            radio->setBandwidth(bw);
                            tinygs_radio.bw = bw;
                        }
                        if (msg.sf >= 5 && msg.sf <= 12) {
                            radio->setSpreadingFactor(msg.sf);
                            tinygs_radio.sf = msg.sf;
                        }
                        if (msg.cr >= 4 && msg.cr <= 8) {
                            radio->setCodingRate(msg.cr);
                            tinygs_radio.cr = msg.cr;
                        }
                        radio->setSyncWord(msg.sw);
                        radio->setPreambleLength(msg.pl);

                        if (msg.fldro == 2) {
                            radio->autoLDRO();
                        } else {
                            radio->forceLDRO(msg.fldro ? true : false);
                        }

                        /* CRC and IQ before header — implicitHeader writes
                         * all packet params including CRC to the radio */
                        radio->setCRC(msg.crc ? 2 : 0);
                        radio->invertIQ(msg.iIQ);
                        tinygs_radio.iIQ = msg.iIQ;

                        if (msg.cl > 0) {
                            radio->implicitHeader(msg.cl);
                        } else {
                            radio->explicitHeader();
                        }

                        radio->setRxBoostedGainMode(true);

                        if (msg.sat) {
                            strncpy(tinygs_radio.satellite, msg.sat,
                                    sizeof(tinygs_radio.satellite) - 1);
                            tinygs_radio.satellite[sizeof(tinygs_radio.satellite) - 1] = '\0';
                        }
                        tinygs_radio.norad = (uint32_t)msg.NORAD;
                    }

                    /* Parse filter (array — not handled by json.h descriptors) */
                    int filt_count = tinygs_parse_filter(
                        tinygs_radio.modem_conf, strlen(tinygs_radio.modem_conf),
                        tinygs_radio.filter, sizeof(tinygs_radio.filter));
                    tinygs_radio.filter_len = (filt_count > 0) ? filt_count : 0;
                    if (filt_count <= 0) tinygs_radio.filter[0] = 0;

                    /* Parse TLE base64 from modem_conf copy (original modified by json_obj_parse) */
                    const char *tlx_p = strstr(tinygs_radio.modem_conf, "\"tlx\":\"");
                    if (tlx_p) {
                        const char *b64_start = tlx_p + 7;
                        const char *b64_end = strchr(b64_start, '"');
                        if (b64_end) {
                            size_t decoded_len = 0;
                            if (base64_decode((uint8_t *)tinygs_radio.tle,
                                              sizeof(tinygs_radio.tle),
                                              &decoded_len,
                                              (const uint8_t *)b64_start,
                                              b64_end - b64_start) == 0
                                && decoded_len == 34) {
                                tinygs_radio.tle_valid = true;
                                tinygs_radio.freq_doppler = 0.0f;
                                LOG_INF("  TLE received (%zu bytes)", decoded_len);
                            } else {
                                tinygs_radio.tle_valid = false;
                            }
                        }
                    } else {
                        tinygs_radio.tle_valid = false;
                    }

                    radio->startReceive();

