Bwooce/tinygs_nRF52/src/main.cpp
    LOG_INF("Mounting FATFS...");

    /* Check FAT boot sector signature BEFORE mounting. FatFs will crash
     * (HardFault) on corrupted FAT data because it follows garbage pointers.
     * Reading raw flash is safe — no FatFs code involved. If invalid,
     * format through the disk driver (which manages the write cache). */
    {
        const struct device *flash_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_flash_controller));
        uint8_t sig[2];
        flash_read(flash_dev, 0xE2000 + 510, sig, 2);
        if (sig[0] == 0xFF && sig[1] == 0xFF) {
            /* Erased flash — fs_mount with MOUNT_MKFS will auto-format */
            LOG_INF("FATFS: partition erased, will auto-format on mount");
        } else if (sig[0] != 0x55 || sig[1] != 0xAA) {
            /* Corrupted data — erase partition and reboot to avoid FatFs crash */
            LOG_WRN("FATFS: corrupt boot sector (0x%02X 0x%02X), erasing",
                    sig[0], sig[1]);
            flash_erase(flash_dev, 0xE2000, 0x6000);
            LOG_INF("Partition erased, rebooting...");
            k_msleep(100);
            sys_reboot(SYS_REBOOT_COLD);
        }
    }

    int res = fs_mount(&mp);
    LOG_INF("FATFS mount: %d", res);

    if (res == 0) {
        /* Write index.html with commissioning info (only if missing) */
        if (fs_stat("/NAND:/index.html", &entry) != 0) {
            /* Get EUI-64 for commissioning info */
            extern char device_client_id[13];
            if (device_client_id[0] == '\0') {
                uint64_t dev_id = NRF_FICR->DEVICEID[0] |
                                  ((uint64_t)NRF_FICR->DEVICEID[1] << 32);
                snprintf(device_client_id, sizeof(device_client_id),
                         "%04X%08X", (unsigned)(dev_id >> 32), (unsigned)dev_id);
            }

            fs_file_t_init(&file);
            if (fs_open(&file, "/NAND:/index.html", FS_O_CREATE | FS_O_WRITE) == 0) {
                /* Write static HTML head */
                fs_write(&file, html_content, strlen(html_content));

                /* Append commissioning info */
                static char commission_html[256];
                int clen = snprintf(commission_html, sizeof(commission_html),
                    "<div class='card' style='margin-top:16px;'>"
                    "<h2>Thread Commissioning</h2>"
                    "<p><strong>MAC / EUI-64:</strong> %s</p>"
                    "<p><strong>Joiner PSKd:</strong> %s</p>"
                    "<p style='font-size:0.8em;color:#666;'>"
                    "Run on your OTBR: <code>ot-ctl commissioner joiner add '*' %s</code></p>"
                    "</div></body></html>",
                    device_client_id,
                    CONFIG_OPENTHREAD_JOINER_PSKD,
                    CONFIG_OPENTHREAD_JOINER_PSKD);
                fs_write(&file, commission_html, clen);
                fs_sync(&file);
                fs_close(&file);
            }
        }

        /* Config.json: bidirectional sync with NVS.
         *
         * NVS is authoritative (loaded later by tinygs_config_init).
         * config.json on the USB drive is a VIEW of the config:
         * - Read config.json → import values that differ from compiled defaults
         *   (this seeds NVS on first boot or when user edits the file)
         * - Write config.json from current runtime values so the drive
         *   always shows the current state for user inspection/editing
         *
         * Flow: read → parse → overwrite with current values → unmount
         */
        {
            static char cfg_buf[256]; /* config.json is ~200 bytes */
            struct fs_file_t cfg;

            /* Read existing config.json if present */
            fs_file_t_init(&cfg);
            if (fs_open(&cfg, "/NAND:/config.json", FS_O_READ) == 0) {
                ssize_t n = fs_read(&cfg, cfg_buf, sizeof(cfg_buf) - 1);
                fs_close(&cfg);
                if (n > 0) {
                    cfg_buf[n] = '\0';
                    LOG_INF("Read config.json (%d bytes)", (int)n);

                    const char *p;
                    p = strstr(cfg_buf, "\"lat\":");
                    if (p) {
                        float v = strtof(p + 6, NULL);
                        if (v >= -90.0f && v <= 90.0f) tinygs_station_lat = v;
                    }
                    p = strstr(cfg_buf, "\"lon\":");
                    if (p) {
                        float v = strtof(p + 6, NULL);
                        if (v >= -180.0f && v <= 180.0f) tinygs_station_lon = v;
                    }
                    p = strstr(cfg_buf, "\"alt\":");
                    if (p) tinygs_station_alt = strtof(p + 6, NULL);

                    p = strstr(cfg_buf, "\"station\":\"");
                    if (p) {
                        const char *end = strchr(p + 11, '"');
                        if (end && (end - p - 11) < (int)sizeof(cfg_station)) {
                            memcpy(cfg_station, p + 11, end - p - 11);
                            cfg_station[end - p - 11] = '\0';
                        }
                    }
                    p = strstr(cfg_buf, "\"mqtt_user\":\"");
                    if (p) {
                        const char *end = strchr(p + 13, '"');
                        if (end && (end - p - 13) < (int)sizeof(cfg_mqtt_user)) {
                            memcpy(cfg_mqtt_user, p + 13, end - p - 13);
                            cfg_mqtt_user[end - p - 13] = '\0';
                        }
                    }
                    p = strstr(cfg_buf, "\"mqtt_pass\":\"");
                    if (p) {
                        const char *end = strchr(p + 13, '"');
                        if (end && (end - p - 13) < (int)sizeof(cfg_mqtt_pass)) {
                            memcpy(cfg_mqtt_pass, p + 13, end - p - 13);
                            cfg_mqtt_pass[end - p - 13] = '\0';
                        }
                    }

                    p = strstr(cfg_buf, "\"display_timeout\":");
                    if (p) {
                        int t = atoi(p + 18);
                        if (t >= 0) tinygs_display_set_timeout((uint32_t)t);
                    }
                }
            }

            /* Write config.json from current values — always, so the drive
             * reflects the current state for user inspection/editing */
            fs_file_t_init(&cfg);
            if (fs_open(&cfg, "/NAND:/config.json", FS_O_CREATE | FS_O_WRITE) == 0) {
                int len = snprintf(cfg_buf, sizeof(cfg_buf),
                    "{\n"
                    "  \"station\": \"%s\",\n"
                    "  \"mqtt_user\": \"%s\",\n"
                    "  \"mqtt_pass\": \"%s\",\n"
                    "  \"lat\": %.4f,\n"
                    "  \"lon\": %.4f,\n"
                    "  \"alt\": %.0f,\n"
                    "  \"display_timeout\": 30\n"
                    "}\n",
                    cfg_station, cfg_mqtt_user, cfg_mqtt_pass,
                    (double)tinygs_station_lat,
                    (double)tinygs_station_lon,
                    (double)tinygs_station_alt);
                fs_write(&cfg, cfg_buf, len);
                fs_sync(&cfg);
                fs_close(&cfg);
                LOG_INF("Wrote config.json (%d bytes)", len);
            }
        }

        /* Flush and unmount before USB MSC takes over */
        disk_access_ioctl("NAND", DISK_IOCTL_CTRL_SYNC, NULL);
        fs_unmount(&mp);
    }

