Bwooce/tinygs_nRF52/src/main.cpp
        LOG_INF("Boot: RESETREAS=0x%08x gpregret=0x%02x [%s%s%s%s%s%s]",
                resetreas, gpregret,
                (resetreas & (1<<0)) ? "PIN " : "",
                (resetreas & (1<<1)) ? "DOG " : "",
                (resetreas & (1<<2)) ? "SREQ " : "",
                (resetreas & (1<<3)) ? "LOCKUP " : "",
                (resetreas & (1<<16)) ? "OFF " : "",
                (resetreas & (1<<17)) ? "DIF " : "");

        if (gpregret == 0x57) {
            LOG_INF("  → 1200-baud bootloader entry");
        }
        if (resetreas & (1<<3)) {
            LOG_ERR("  → CPU LOCKUP detected! (fault-in-fault-handler)");
        }
    }

    /* Check for crash diagnostic from previous boot (retained RAM) */
    if ((crash_reason & 0xFFFF0000) == CRASH_MAGIC) {
        LOG_ERR("*** PREVIOUS CRASH: reason=%u PC=0x%08x LR=0x%08x ***",
                (unsigned)(crash_reason & 0xFFFF),
                (unsigned)crash_pc, (unsigned)crash_lr);
        LOG_ERR("Use: arm-zephyr-eabi-addr2line -e build/zephyr/zephyr.elf 0x%08x",
                (unsigned)crash_pc);
        crash_reason = 0; /* Clear so we don't report again */
    }

    log_heap_usage("boot");
    init_openthread();

#if defined(CONFIG_IOT_LOG)
    {
        iot_log_config_t log_cfg = IOT_LOG_CONFIG_DEFAULT();
        log_cfg.device_name = "TinyGS-nRF52";
        log_cfg.level = IOT_LOG_DEBUG;
        log_cfg.always_on = false;
        iot_log_init(&log_cfg);
    }
#endif

    /* Check if device has Thread credentials (commissioned).
     * If not, stay fully awake for 15 minutes to allow Joiner commissioning.
     * The user needs time to scan the QR code from index.html. */
    {
        struct openthread_context *ot_ctx = openthread_get_default_context();
        if (ot_ctx) {
            openthread_api_mutex_lock(ot_ctx);
            bool commissioned = otDatasetIsCommissioned(ot_ctx->instance);
            openthread_api_mutex_unlock(ot_ctx);

            if (!commissioned) {
                LOG_INF("*** COMMISSIONING MODE ***");
                LOG_INF("Device not provisioned — staying awake for 15 minutes");
                LOG_INF("Joiner PSKd: %s", CONFIG_OPENTHREAD_JOINER_PSKD);
                LOG_INF("Scan QR code from index.html or run:");
                LOG_INF("  ot-ctl commissioner joiner add '*' %s",
                        CONFIG_OPENTHREAD_JOINER_PSKD);
                /* Keep display on during commissioning */
                tinygs_display_set_timeout(900); /* 15 minutes */
            } else {
                LOG_INF("Thread credentials found — normal mode");
            }
        }
    }

    /* Load persistent config from NVS. Must be AFTER init_openthread()
     * because OpenThread initializes the settings/NVS subsystem.
     * No extra CONFIG_SETTINGS needed in prj.conf — OpenThread provides it.
     * config.json values are loaded first (in setup_usb_storage), then
     * NVS overrides with any previously saved values. */
    tinygs_config_init();
    tinygs_display_init();
    watchdog_init();
    led_init();
    breathing_led_init();
    init_radio();

    int retry_count = 0;
    int mqtt_poll_fd_count = 0;
    struct zsock_pollfd mqtt_poll_fd;

    while (1) {
        switch (app_state) {

        case STATE_WAIT_THREAD:
            /* Blue blink while waiting for Thread */
            neopixel_set(0, 0, (k_uptime_get_32() / 500) % 2 ? 20 : 0,  NEO_OFF); /* Blue blink = waiting for Thread */
            if (thread_attached) {
                /* Heap stats now in periodic STATUS log */
                LOG_INF("--- Thread attached, waiting 5s for routing to stabilize ---");
                k_msleep(5000);
#if defined(CONFIG_IOT_LOG)
                /* Trigger deferred multicast join now that Thread is attached */
                iot_log_poll();
#endif
                app_state = STATE_DNS_RESOLVE;
                retry_count = 0;
            } else {
                LOG_INF("Waiting for Thread network... (%ds)", retry_count * 10);
                log_ot_diagnostics();
                retry_count++;
                k_msleep(10000);
            }
            break;

        case STATE_DNS_RESOLVE:
            /* Heap stats now in periodic STATUS log */
            log_ot_diagnostics();
            if (resolve_broker() == 0) {
                app_state = STATE_MQTT_CONNECT;
            } else {
                retry_count++;
                if (retry_count > 10) {
                    LOG_ERR("DNS failed after %d attempts", retry_count);
                    app_state = STATE_ERROR;
                } else {
                    LOG_WRN("DNS retry %d/10 in 5s...", retry_count);
                    k_msleep(5000);
                }
            }
            break;

        case STATE_MQTT_CONNECT:
            /* Heap stats now in periodic STATUS log */
            if (mqtt_tls_connect() == 0) {
                /* Set up poll fd for mqtt_input */
                mqtt_poll_fd.fd = mqtt_client.transport.tls.sock;
                mqtt_poll_fd.events = ZSOCK_POLLIN;
                mqtt_poll_fd_count = 1;

                /* Process until CONNACK or timeout */
                int wait_ms = 15000; /* 15s for TLS handshake + CONNACK */
                while (app_state == STATE_MQTT_CONNECT && wait_ms > 0) {
                    int rc = zsock_poll(&mqtt_poll_fd, mqtt_poll_fd_count, 1000);
                    if (rc > 0) {
                        mqtt_input(&mqtt_client);
                    }
                    mqtt_live(&mqtt_client);
                    wait_ms -= 1000;
                }
                if (app_state == STATE_MQTT_CONNECT) {
                    LOG_ERR("MQTT connect timeout (no CONNACK in 15s)");
                    mqtt_disconnect(&mqtt_client);
                    app_state = STATE_ERROR;
                }
            } else {
                app_state = STATE_ERROR;
            }
            break;

        case STATE_MQTT_CONNECTED: {
            LOG_INF("MQTT connected, entering main loop");
            neopixel_off(); /* NeoPixels off when stable */
            breathing_led_start(); /* Green LED breathes when connected */

            /* Sync time via SNTP — needed for Doppler compensation */
            if (!time_synced) {
                sntp_sync();
            }

            /* TinyGS main loop — process MQTT, LoRa RX, and pings */
            uint32_t last_ping_ms = k_uptime_get_32();
            uint32_t last_status_log_ms = last_ping_ms;
            #define STATUS_LOG_INTERVAL_MS 300000 /* 5 minutes */

            while (app_state == STATE_MQTT_CONNECTED) {
                /* Poll MQTT socket for incoming data */
                int rc = zsock_poll(&mqtt_poll_fd, mqtt_poll_fd_count, 100);
                if (rc > 0) {
                    mqtt_input(&mqtt_client);
                }
                {
                    int live_ret = mqtt_live(&mqtt_client);
                    if (live_ret && live_ret != -EAGAIN) {
                        LOG_DBG("mqtt_live: %d", live_ret);
                    }
                }

